﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <IT8728F.uni>
//
// Description: HWM form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
//If customer define the common logical device by themselves, add here.

//
// HardWare Monitor 
//
#string STR_IT8728F_HMM_CONFIGURATION                   #language eng "Hardware Monitor"
#string STR_IT8728F_HMM_CONFIGURATION_HELP              #language eng "Monitor hardware status"

#string STR_PC_HEALTH                                   #language eng "Pc Health Status"
#string STR_IT8728F_HMM_VIN0                            #language eng "VIN0"
#string STR_IT8728F_HMM_VIN0_VALUE                      #language eng "N/A"

//RayWu, ADD 2015/05/05 >>
//---------------------------------------------------------------------------
// IT8728 Smart Fan Setup String
//---------------------------------------------------------------------------
#string STR_IT8728SMF1CONTROL		#language eng "CPU FAN1 Smart Control"
#string STR_IT8728SMF1CONTROL_HELP	#language eng "For En/Disable CPU FAN1 Smart Control\nEnabled: FAN is running in accordance with user settings\nDisabled: FAN is always running with full speed"
#string STR_IT8728SMFMODE		#language eng "  FAN Control Mode"
#string STR_IT8728SMF1MODE_HELP		#language eng "Manual Mode: Depends on PWM Duty\nAutomatic Mode: FAN Speed is depends on CPU Temperature"
#string STR_MANUAL_MODE			#language eng "Manual Mode"
#string STR_AUTO_MODE			#language eng "Automatic Mode"
#string STR_IT8728SMFPWMDUTY		#language eng "  PWM Duty"
#string STR_IT8728SMFPWMDUTY_HELP	#language eng "Manual Mode PWM Duty value\nRange:[0 - 255]"
#string STR_IT8728SMFSPINPWMDUTY	#language eng "  Spin PWM"
#string STR_IT8728SMFSPINPWMDUTY_HELP	#language eng "The PWM Duty of FAN Spin\nRange:[0 - 255]"
// >> 2015/08/26 Eric
#string STR_IT8728SMFTEMPSRC		#language eng "  Temperature Source"
#string STR_IT8728SMFTEMPSRC_HELP	#language eng "Reference Temperature Input Selection.\n0x00 : TMPIN1\n0x01 : TMPIN2\n0x02 : TMPIN3"
#string STR_TMPIN1			#language eng "TMPIN1"
#string STR_TMPIN2			#language eng "TMPIN2"
#string STR_TMPIN3			#language eng "TMPIN3"
// << 2015/08/26 Eric
#string STR_IT8728SMFOFFTEMP		#language eng "  Off Control Temperature"
#string STR_IT8728SMFOFFTEMP_HELP	#language eng "Temperature Limit Value of Fan Off\nNote: Some fans have the minimum speed even if the PWM value is 0"
#string STR_IT8728SMFSTARTTEMP		#language eng "  Start Control Temperature"
#string STR_IT8728SMFSTARTTEMP_HELP	#language eng "Temperature Limit Value of FAN Start Control"
#string STR_IT8728SMFFULLTEMP		#language eng "  Full Speed Temperature"
#string STR_IT8728SMFFULLTEMP_HELP	#language eng "Temperature Limit Value of FAN Full Speed"
#string STR_IT8728SMFPWMSLOPE		#language eng "  PWM Slope"
#string STR_IT8728SMFPWMSLOPE_HELP	#language eng "Slope PWM value/Degree C for FAN Speed Control\nRange:[1-15]"
#string STR_IT8728SMF2CONTROL		#language eng "SYS FAN1 Smart Control"
#string STR_IT8728SMF2CONTROL_HELP	#language eng "For En/Disable SYS FAN1 Smart Control\nEnabled: FAN is running in accordance with user settings\nDisabled: FAN is always running with full speed"
#string STR_IT8728SMF2MODE_HELP		#language eng "Manual Mode: Depends on PWM Duty\nAutomatic Mode: FAN Speed is depends on System Temperature"
// >> 2015/08/25 Eric
#string STR_IT8728SMF3CONTROL		#language eng "SYS FAN2 Smart Control"
#string STR_IT8728SMF3CONTROL_HELP	#language eng "For En/Disable SYS FAN2 Smart Control\nEnabled: FAN is running in accordance with user settings\nDisabled: FAN is always running with full speed"
#string STR_IT8728SMF3MODE_HELP		#language eng "Manual Mode: Depends on PWM Duty\nAutomatic Mode: FAN Speed is depends on System Temperature"
// << 2015/08/25 Eric
#string STR_IT8728SMF1CONTROL		#language eng "CPU_FAN Smart Control"
#string STR_IT8728SMF2CONTROL		#language eng "SYS_FAN Smart Control"
//RayWu, ADD 2015/05/05 <<
// >> 2017/03/22 Eric
#string STR_HWM_CPU_DTS			#language eng "CPU DTS Temperature"
#string STR_HWM_CPU_DTS_VALUE		#language eng "N/A"
#string STR_IT8728SMF4MODE		#language eng "Fan 4 Control Mode"
#string STR_IT8728SMF4MODE_HELP		#language eng "Fan 4 Control Mode Setting\nOption: The same as Fan 1/2/3"
#string STR_IT8728SMF5MODE		#language eng "Fan 5 Control Mode"
#string STR_IT8728SMF5MODE_HELP		#language eng "Fan 5 Control Mode Setting\nOption: The same as Fan 1/2/3"
#string STR_SAME_WITH_FAN1		#language eng "The same as Fan1"
#string STR_SAME_WITH_FAN2		#language eng "The same as Fan2"
#string STR_SAME_WITH_FAN3		#language eng "The same as Fan3"
// << 2017/03/22 Eric

//#string <string name>                   #language eng ""
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
